import React from "react";
import styled from "styled-components";

const Container = styled.div`
  max-width: 800px;
  margin: 0 auto;
  padding: 20px;
  font-family: 'Arial', sans-serif;
  color: #333;
  line-height: 1.6;

  h1 {
    font-size: 2em;
    color: #007bff;
    margin-bottom: 10px;
  }

  p {
    font-size: 1.1em;
    margin-bottom: 20px;
  }
`;

const Home = () => {
  return (
    <Container>
      <h1>რა არის Dom და ra განსხვავებაა Dom და ვირტუალ დომს შორის</h1>
      <p>
      DOM არის ვებ გვერდის სტრუქტურის მოდელი, რომელიც გადაწერს HTML, XML ან XHTML დოკუმენტს ობიექტურ სტრუქტურაში.
      Virtual Dom არის კონცეფცია, რომელიც გამოიყენება ვებ-გვერდის განვითარების ჩარჩოებში, როგორიცაა React.
       ეს არის რეალური DOM-ის მსუბუქი ასლი და გამოიყენება შესრულების გასაუმჯობესებლად.
       მოკლედ, DOM არის დოკუმენტის პირდაპირი წარმოდგენა ბრაუზერში, ხოლო ვირტუალური DOM არის ტექნიკა, რომელიც გამოიყენება გარკვეულ ჩარჩოებში, ფაქტობრივი DOM-ის განახლების პროცესის ოპტიმიზაციისთვის.
      </p>
      <h1>რა არის UseState hook და რისთვის გამოიყნება</h1>
      <p>
      useState hook გამოიყენება
ფუნქციური კომპონენტების მდგომარეობის დასამატებლად. შეგვიძლია გამოაცხადოთ
მდგომარეობის ცვლადები ფუნქციურ კომპონენტებში, რაც საშუალებას გვაძლევს ვმართოთ და
განვაახლოთ მდგომარეობა. useState hook იღებს საწყის მდგომარეობას არგუმენტად და
აბრუნებს მასივს ორი ელემენტით
      </p>
      <h1>რა განსხვავებაა USeMemo and UseCallback </h1>
      <p>useMemo გამოიყენება მნიშვნელობების დასამახსოვრებლად, ხოლო useCallback გამოიყენება ფუნქციების დასამახსოვრებლად. ორივე არის ოპტიმიზაციის ტექნიკა, რათა თავიდან იქნას აცილებული არასაჭირო გამოთვლები ან რენდერები React აპლიკაციაში.
</p>
      <h1>რა არის რეაქტ როუტერი და რისთვის გამოიყენება?</h1>
      <p> React Router არის გადამწყვეტი ინსტრუმენტი ნავიგაციის მართვისთვის React აპლიკაციებში, რაც უზრუნველყოფს უწყვეტ და ეფექტურ გზას მომხმარებლებისთვის დინამიური, ერთგვერდიანი გამოცდილების შესაქმნელად.</p>
      <h1>რა არის Props?</h1>
      <p>props არის არგუმენტები, რომლებიც გადაეცემა React კომპონენტებს.</p>
    </Container>
  );
};

export default Home;
